'use client'

import styles from './Categories.module.scss'
import { useEffect, useState } from 'react'

type Category = {
  type: number
  item_id: number
  name: string
  price: number
  total_count: number
  total_price: number
}

export default function Categories() {
  const [categories, setCategories] = useState<Category[]>([])

  useEffect(() => {
    fetch('/api/categories')
      .then(res => res.json())
      .then(data => {
        console.log('CATEGORIES:', data)
        setCategories(data.categories || [])
      })
      .catch(err => console.error(err))
  }, [])

  const cards = [0, 1, 2]

  const totalSum = categories.reduce(
    (sum, item) => sum + (item?.total_price || 0),
    0
  )

  const colors = [
    styles['categories__sell-item--blue'],
    styles['categories__sell-item--orange'],
    styles['categories__sell-item--green']
  ]

  const maxCount = Math.max(...categories.map(c => c.total_count), 0)

  return (
    <section className={styles['categories']}>
      <div className="container">
        <div className={styles['categories__content']}>
          <div className={styles['categories__sell']}>
            <div className={`main-title-wrapper ${styles['categories__title-wrapper']}`}>
              <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M5 9.32077C5 7.04666 6.84353 5.20312 9.11765 5.20312H14.0588V14.2619H5V9.32077Z" fill="url(#paint0_linear_380_1364)" />
                <path d="M5 17.1443H14.0588V26.2031H9.11765C6.84353 26.2031 5 24.3596 5 22.0855V17.1443Z" fill="url(#paint1_linear_380_1364)" />
                <path d="M16.9412 5.20312H21.8824C24.1565 5.20312 26 7.04666 26 9.32077V14.2619H16.9412V5.20312Z" fill="url(#paint2_linear_380_1364)" />
                <path d="M16.9412 17.1443H26V22.0855C26 24.3596 24.1565 26.2031 21.8824 26.2031H16.9412V17.1443Z" fill="white" fillOpacity="0.15" />
                <defs>
                  <linearGradient id="paint0_linear_380_1364" x1="6.24576" y1="6.44889" x2="22.0847" y2="26.2031" gradientUnits="userSpaceOnUse">
                    <stop stopColor="#FFAB4C" />
                    <stop offset="1" stopColor="#924E02" />
                  </linearGradient>
                  <linearGradient id="paint1_linear_380_1364" x1="6.24576" y1="6.44889" x2="22.0847" y2="26.2031" gradientUnits="userSpaceOnUse">
                    <stop stopColor="#9C82F6" />
                    <stop offset="1" stopColor="#3F18C9" />
                  </linearGradient>
                  <linearGradient id="paint2_linear_380_1364" x1="6.24576" y1="6.44889" x2="22.0847" y2="26.2031" gradientUnits="userSpaceOnUse">
                    <stop stopColor="#4CB4FF" />
                    <stop offset="1" stopColor="#00406E" />
                  </linearGradient>
                </defs>
              </svg>
              <h2 className={'main-title'}>Продажа по категориям</h2>
            </div>

            <ul className={`list-reset ${styles['categories__sell-list']}`}>

              {cards.map(i => {
                const item = categories[i]

                const percent = item && totalSum
                  ? Math.round((item.total_price / totalSum) * 100)
                  : 0

                return (
                  <li
                    key={i}
                    className={`${styles['categories__sell-item']} ${colors[i]}`}
                  >

                    <img
                      className={styles['categories__sell-item-img']}
                      src={`/categories/categories-${i + 1}.png`}
                      alt=""
                      aria-hidden
                    />

                    <div className={styles['categories__sell-item-block']}>
                      Категория
                      <span>{item ? item.name : '-'}</span>
                    </div>

                    <div className={styles['categories__sell-item-block']}>
                      Цена
                      <span>
                        {item
                          ? `${item.price.toLocaleString('ru-RU')} RC`
                          : '-'}
                      </span>
                    </div>

                    <div className={`${styles['categories__sell-item-block']} ${styles['categories__sell-item-block--percent']}`}>
                      График
                      <span>
                        <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                          <path d="M15.3234 6.82329L16 3L12.0375 3.08738L13.2586 4.47572L9.11874 8.52819L6.59572 5.26005L0.173596 11.9446C-0.0684096 12.1966 -0.0558224 12.593 0.20157 12.8301C0.459019 13.067 0.863973 13.0546 1.10608 12.8027L6.48915 7.19972L8.9842 10.4322L14.096 5.42782L15.3234 6.82329Z" fill="#42F43D" />
                        </svg>

                        {item ? `+${percent}%` : '-'}
                      </span>
                    </div>

                    <div
                      className={`${styles['categories__sell-item-block']} ${styles['categories__sell-item-block--val']}`}
                    >
                      {item ? `${item.total_count} шт` : '-'}
                    </div>

                  </li>
                )
              })}

            </ul>
          </div>

          <div className={styles['categories__recommendations']}>
            <h2 className={styles['categories__recommendations-title']}>Рекомендации</h2>

            <ul className={`list-reset ${styles['categories__recommendations-list']}`}>
              <li className={styles['categories__recommendations-item']}>
                <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <rect width="44" height="44" rx="10" fill="white" fillOpacity="0.1" />
                  <rect width="44" height="44" rx="10" fill="url(#paint0_linear_614_3886)" />
                  <rect width="44" height="44" rx="10" fill="url(#paint1_linear_614_3886)" />
                  <path d="M26.1939 12H17.8139C14.1739 12 12.0039 14.17 12.0039 17.81V26.18C12.0039 29.83 14.1739 32 17.8139 32H26.1839C29.8239 32 31.9939 29.83 31.9939 26.19V17.81C32.0039 14.17 29.8339 12 26.1939 12ZM17.6339 28.15C17.6339 28.56 17.2939 28.9 16.8839 28.9C16.4739 28.9 16.1339 28.56 16.1339 28.15V26.08C16.1339 25.67 16.4739 25.33 16.8839 25.33C17.2939 25.33 17.6339 25.67 17.6339 26.08V28.15ZM22.7539 28.15C22.7539 28.56 22.4139 28.9 22.0039 28.9C21.5939 28.9 21.2539 28.56 21.2539 28.15V24C21.2539 23.59 21.5939 23.25 22.0039 23.25C22.4139 23.25 22.7539 23.59 22.7539 24V28.15ZM27.8739 28.15C27.8739 28.56 27.5339 28.9 27.1239 28.9C26.7139 28.9 26.3739 28.56 26.3739 28.15V21.93C26.3739 21.52 26.7139 21.18 27.1239 21.18C27.5339 21.18 27.8739 21.52 27.8739 21.93V28.15ZM27.8739 18.77C27.8739 19.18 27.5339 19.52 27.1239 19.52C26.7139 19.52 26.3739 19.18 26.3739 18.77V17.8C23.8239 20.42 20.6339 22.27 17.0639 23.16C17.0039 23.18 16.9439 23.18 16.8839 23.18C16.5439 23.18 16.2439 22.95 16.1539 22.61C16.0539 22.21 16.2939 21.8 16.7039 21.7C20.0739 20.86 23.0739 19.09 25.4539 16.59H24.2039C23.7939 16.59 23.4539 16.25 23.4539 15.84C23.4539 15.43 23.7939 15.09 24.2039 15.09H27.1339C27.1739 15.09 27.2039 15.11 27.2439 15.11C27.2939 15.12 27.3439 15.12 27.3939 15.14C27.4439 15.16 27.4839 15.19 27.5339 15.22C27.5639 15.24 27.5939 15.25 27.6239 15.27C27.6339 15.28 27.6339 15.29 27.6439 15.29C27.6839 15.33 27.7139 15.37 27.7439 15.41C27.7739 15.45 27.8039 15.48 27.8139 15.52C27.8339 15.56 27.8339 15.6 27.8439 15.65C27.8539 15.7 27.8739 15.75 27.8739 15.81C27.8739 15.82 27.8839 15.83 27.8839 15.84V18.77H27.8739Z" fill="#BEFF8F" />
                  <defs>
                    <linearGradient id="paint0_linear_614_3886" x1="2.61017" y1="2.61017" x2="35.7966" y2="44" gradientUnits="userSpaceOnUse">
                      <stop stopColor="#FFAB4C" />
                      <stop offset="1" stopColor="#924E02" />
                    </linearGradient>
                    <linearGradient id="paint1_linear_614_3886" x1="2.61017" y1="2.61017" x2="35.7966" y2="44" gradientUnits="userSpaceOnUse">
                      <stop stopColor="#91FF4C" />
                      <stop offset="1" stopColor="#446E00" />
                    </linearGradient>
                  </defs>
                </svg>
                <div className={styles['categories__recommendations-item-text']}>
                  Добавить больше
                  <span>Суперкары показывают рост +45%</span>
                </div>
              </li>
              <li className={styles['categories__recommendations-item']}>
                <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <rect width="44" height="44" rx="10" fill="white" fillOpacity="0.1" />
                  <rect width="44" height="44" rx="10" fill="url(#paint0_linear_614_3922)" />
                  <path fillRule="evenodd" clipRule="evenodd" d="M23.7328 13.7832C22.963 12.4499 21.0377 12.4499 20.2679 13.7832L11.7709 28.5C11.0011 29.8333 11.9637 31.5 13.5033 31.5H30.4974L30.64 31.4961C32.0955 31.3971 32.9756 29.7917 32.2299 28.5L23.7328 13.7832ZM21.0277 27.0771C21.0277 27.6119 21.466 28.0454 22.0007 28.0454C22.5355 28.0454 22.9737 27.6119 22.9737 27.0771C22.9737 26.5424 22.5355 26.1089 22.0007 26.1089C21.466 26.1089 21.0277 26.5424 21.0277 27.0771ZM21.2976 19.7485C21.2976 19.3602 21.6124 19.0454 22.0007 19.0454C22.389 19.0454 22.7038 19.3602 22.7038 19.7485V24.2534C22.7038 24.6417 22.389 24.9565 22.0007 24.9565C21.6124 24.9565 21.2976 24.6417 21.2976 24.2534V19.7485Z" fill="#CFC0FF" />
                  <defs>
                    <linearGradient id="paint0_linear_614_3922" x1="2.61017" y1="2.61017" x2="35.7966" y2="44" gradientUnits="userSpaceOnUse">
                      <stop stopColor="#9C82F6" />
                      <stop offset="1" stopColor="#3F18C9" />
                    </linearGradient>
                  </defs>
                </svg>
                <div className={styles['categories__recommendations-item-text']}>
                  Обратить внимание
                  <span>Квартиры падают на -8%</span>
                </div>
              </li>
              <li className={styles['categories__recommendations-item']}>
                <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <rect width="44" height="44" rx="10" fill="white" fillOpacity="0.1" />
                  <rect width="44" height="44" rx="10" fill="url(#paint0_linear_614_3894)" />
                  <rect width="44" height="44" rx="10" fill="url(#paint1_linear_614_3894)" />
                  <path d="M32.5694 23.2354H32.485C31.9047 23.2354 31.4299 22.7606 31.4299 22.1803C31.4299 21.6001 31.9047 21.1253 32.485 21.1253C33.0652 21.1253 33.5822 21.6001 33.5822 22.1803C33.5822 22.7606 33.1496 23.2354 32.5694 23.2354ZM11.5535 23.2354H11.4691C10.8888 23.2354 10.4141 22.7606 10.4141 22.1803C10.4141 21.6001 10.8888 21.1253 11.4691 21.1253C12.0493 21.1253 12.5663 21.6001 12.5663 22.1803C12.5663 22.7606 12.1337 23.2354 11.5535 23.2354ZM29.4149 15.8397C29.1406 15.8397 28.8768 15.7342 28.6658 15.5338C28.2543 15.1223 28.2543 14.4576 28.6658 14.0462L28.803 13.909C29.2144 13.4976 29.8791 13.4976 30.2905 13.909C30.702 14.3205 30.702 14.9852 30.2905 15.3966L30.1534 15.5338C29.9529 15.7342 29.6892 15.8397 29.4149 15.8397ZM14.6236 15.8397C14.3493 15.8397 14.0855 15.7342 13.8745 15.5338L13.7374 15.3861C13.3259 14.9746 13.3259 14.3099 13.7374 13.8985C14.1488 13.487 14.8135 13.487 15.2249 13.8985L15.3621 14.0356C15.7735 14.4471 15.7735 15.1118 15.3621 15.5232C15.1616 15.7342 14.8873 15.8397 14.6236 15.8397ZM22.0192 12.7274C21.439 12.7274 20.9642 12.2949 20.9642 11.7146V11.6302C20.9642 11.05 21.439 10.5752 22.0192 10.5752C22.5995 10.5752 23.0742 11.05 23.0742 11.6302C23.0742 12.2105 22.5995 12.7274 22.0192 12.7274Z" fill="white" />
                  <path d="M32.5694 23.2354H32.485C31.9047 23.2354 31.4299 22.7606 31.4299 22.1803C31.4299 21.6001 31.9047 21.1253 32.485 21.1253C33.0652 21.1253 33.5822 21.6001 33.5822 22.1803C33.5822 22.7606 33.1496 23.2354 32.5694 23.2354ZM11.5535 23.2354H11.4691C10.8888 23.2354 10.4141 22.7606 10.4141 22.1803C10.4141 21.6001 10.8888 21.1253 11.4691 21.1253C12.0493 21.1253 12.5663 21.6001 12.5663 22.1803C12.5663 22.7606 12.1337 23.2354 11.5535 23.2354ZM29.4149 15.8397C29.1406 15.8397 28.8768 15.7342 28.6658 15.5338C28.2543 15.1223 28.2543 14.4576 28.6658 14.0462L28.803 13.909C29.2144 13.4976 29.8791 13.4976 30.2905 13.909C30.702 14.3205 30.702 14.9852 30.2905 15.3966L30.1534 15.5338C29.9529 15.7342 29.6892 15.8397 29.4149 15.8397ZM14.6236 15.8397C14.3493 15.8397 14.0855 15.7342 13.8745 15.5338L13.7374 15.3861C13.3259 14.9746 13.3259 14.3099 13.7374 13.8985C14.1488 13.487 14.8135 13.487 15.2249 13.8985L15.3621 14.0356C15.7735 14.4471 15.7735 15.1118 15.3621 15.5232C15.1616 15.7342 14.8873 15.8397 14.6236 15.8397ZM22.0192 12.7274C21.439 12.7274 20.9642 12.2949 20.9642 11.7146V11.6302C20.9642 11.05 21.439 10.5752 22.0192 10.5752C22.5995 10.5752 23.0742 11.05 23.0742 11.6302C23.0742 12.2105 22.5995 12.7274 22.0192 12.7274Z" fill="#FFC788" />
                  <path d="M25.014 33.4253C24.9584 33.4253 24.8937 33.416 24.8381 33.3975C22.9781 32.8701 21.0256 32.8701 19.1656 33.3975C18.8232 33.4901 18.4623 33.2958 18.3697 32.9534C18.2679 32.611 18.4715 32.2501 18.8139 32.1575C20.9053 31.5653 23.1077 31.5653 25.199 32.1575C25.5414 32.2593 25.745 32.611 25.6432 32.9534C25.5507 33.2402 25.2916 33.4253 25.014 33.4253Z" fill="white" />
                  <path d="M25.014 33.4253C24.9584 33.4253 24.8937 33.416 24.8381 33.3975C22.9781 32.8701 21.0256 32.8701 19.1656 33.3975C18.8232 33.4901 18.4623 33.2958 18.3697 32.9534C18.2679 32.611 18.4715 32.2501 18.8139 32.1575C20.9053 31.5653 23.1077 31.5653 25.199 32.1575C25.5414 32.2593 25.745 32.611 25.6432 32.9534C25.5507 33.2402 25.2916 33.4253 25.014 33.4253Z" fill="#FFC788" />
                  <path d="M28.6692 18.9523C27.7068 17.009 25.8468 15.5747 23.6907 15.1027C21.4327 14.603 19.1193 15.1398 17.3518 16.5649C15.5751 17.9807 14.5664 20.0998 14.5664 22.367C14.5664 24.7637 16.0007 27.2715 18.1661 28.7244V29.4924C18.1569 29.7515 18.1476 30.1495 18.4623 30.4733C18.7861 30.8065 19.2673 30.8435 19.6468 30.8435H24.394C24.8937 30.8435 25.2731 30.7047 25.5322 30.4456C25.8838 30.0847 25.8746 29.622 25.8653 29.3721V28.7244C28.734 26.7903 30.5385 22.7094 28.6692 18.9523ZM23.5889 23.8198L22.5987 25.5411C22.4692 25.7631 22.2378 25.8927 21.9972 25.8927C21.8769 25.8927 21.7566 25.8649 21.6548 25.8002C21.3217 25.6058 21.2106 25.1802 21.3957 24.8563L22.1823 23.4867H21.405C20.9423 23.4867 20.5629 23.2831 20.3593 22.9407C20.1557 22.5891 20.1742 22.1634 20.4056 21.7562L21.3957 20.035C21.5901 19.7019 22.0157 19.5908 22.3396 19.7759C22.6727 19.9703 22.7838 20.3959 22.5987 20.7198L21.8121 22.0894H22.5895C23.0522 22.0894 23.4316 22.293 23.6351 22.6354C23.8387 22.987 23.8202 23.4219 23.5889 23.8198Z" fill="white" />
                  <path d="M28.6692 18.9523C27.7068 17.009 25.8468 15.5747 23.6907 15.1027C21.4327 14.603 19.1193 15.1398 17.3518 16.5649C15.5751 17.9807 14.5664 20.0998 14.5664 22.367C14.5664 24.7637 16.0007 27.2715 18.1661 28.7244V29.4924C18.1569 29.7515 18.1476 30.1495 18.4623 30.4733C18.7861 30.8065 19.2673 30.8435 19.6468 30.8435H24.394C24.8937 30.8435 25.2731 30.7047 25.5322 30.4456C25.8838 30.0847 25.8746 29.622 25.8653 29.3721V28.7244C28.734 26.7903 30.5385 22.7094 28.6692 18.9523ZM23.5889 23.8198L22.5987 25.5411C22.4692 25.7631 22.2378 25.8927 21.9972 25.8927C21.8769 25.8927 21.7566 25.8649 21.6548 25.8002C21.3217 25.6058 21.2106 25.1802 21.3957 24.8563L22.1823 23.4867H21.405C20.9423 23.4867 20.5629 23.2831 20.3593 22.9407C20.1557 22.5891 20.1742 22.1634 20.4056 21.7562L21.3957 20.035C21.5901 19.7019 22.0157 19.5908 22.3396 19.7759C22.6727 19.9703 22.7838 20.3959 22.5987 20.7198L21.8121 22.0894H22.5895C23.0522 22.0894 23.4316 22.293 23.6351 22.6354C23.8387 22.987 23.8202 23.4219 23.5889 23.8198Z" fill="#FFC788" />
                  <defs>
                    <linearGradient id="paint0_linear_614_3894" x1="2.61017" y1="2.61017" x2="35.7966" y2="44" gradientUnits="userSpaceOnUse">
                      <stop stopColor="#4CB4FF" />
                      <stop offset="1" stopColor="#00406E" />
                    </linearGradient>
                    <linearGradient id="paint1_linear_614_3894" x1="2.61017" y1="2.61017" x2="35.7966" y2="44" gradientUnits="userSpaceOnUse">
                      <stop stopColor="#FFAB4C" />
                      <stop offset="1" stopColor="#924E02" />
                    </linearGradient>
                  </defs>
                </svg>

                <div className={styles['categories__recommendations-item-text']}>
                  Новая ниша
                  <span>Рассмотреть яхты премиум-класса</span>
                </div>
              </li>
            </ul>

          </div>

        </div>
      </div>
    </section>
  )
}
